tests/load/variant1.yaml
config:
  name: "Calls to existing images (no missing files, no resizes)"
  target: http://localhost:50001
  phases:
    - duration: 60
      arrivalRate:  50
      name: "Constant low load"
    - duration: 60
      arrivalRate:  50
      rampTo: 500
      name: "Increasing low to mid load"
    - duration: 120
      arrivalRate:  1000
      name: "Sustained high load"
  variables:
    images:
      - ["node_00001.png", "node_00002.png", "node_00003.png", "node_00004.png", "node_00005.jpg"]
scenarios:
  - flow:
    - loop:
      - get:
          url: "/api/image/{{ $loopElement }}"
      over: images