tests/load/variant3.yaml
config:
  name: "Calls to existing images, missing files or resizes"
  target: http://localhost:50001
  phases:
    - duration: 60
      arrivalRate:  50
      name: "Constant low load"
    - duration: 60
      arrivalRate:  50
      rampTo: 500
      name: "Increasing low to mid load"
    - duration: 120
      arrivalRate:  1000
      name: "Sustained high load"
  payload:
    -
      path: "payload-images.csv"
      fields:
        - "image"
      order:  sequence
    -
      path: "payload-sizes.csv"
      fields:
        - "size"
      order:  random       
scenarios:
  - flow:
    - get:
        url: "/api/image/{{ image }}"
    name: "GET existing/missing image"
    weight: 2
  - flow:
    - get:
        url: "/api/image/{{ image }}?size={{ size }}"
    name: "GET resized image"
    weight: 3